<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Language names
    |--------------------------------------------------------------------------
    |
    |
    */

    'browser_preference' => '브라우저 설정',
    'en' => 'English (영어)',
    'fr' => 'Français (프랑스어)',
    'bg' => 'Български (불가리아어)',
    'zh-CN' => '简体中文 (중국어 간체)',
    'da' => 'Dansk (덴마크어)',
    'nl' => 'Nederlands (네덜란드어)',
    'de' => 'Deutsch (독일어)',
    'hi' => 'हिंदी (힌디어)',
    'it' => 'Italiano (이탈리아어)',
    'ja' => '日本語 (일본어)',
    'ko' => '한국어',
    'pt-BR' => 'Português (포르투갈어)',
    'ru' => 'Pусский (러시아어)',
    'es-ES' => 'Español (스페인어)',
    'tr' => 'Türkçe (튀르키예어)',
];