<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Language names
    |--------------------------------------------------------------------------
    |
    |
    */

    'browser_preference' => '브라우저 설정',
    'en' => 'English (영어)',
    'fr' => 'Français (프랑스어)',
    'de' => 'Deutsch (독일어)',
    'es' => 'Español (스페인어)',
    'zh' => '简体中文 (중국어 간체)',
    'ru' => 'Pусский (러시아어)',
    'bg' => 'Български (불가리아어)',
    'ja' => '日本語 (일본어)',
    'hi' => 'हिंदी (힌디어)',
    'tr' => 'Türkçe (튀르키예어)',
];