<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Language names
    |--------------------------------------------------------------------------
    |
    |
    */

    'browser_preference' => 'По предпочитание на браузъра',
    'en' => 'English (Английски)',
    'fr' => 'Français (Френски)',
    'de' => 'Deutsch (Немски)',
    'es' => 'Español (Испански)',
    'zh' => '简体中文 (Китайски опростен)',
    'ru' => 'Русский (Руски)',
    'bg' => 'Български (Български)',
    'ja' => '日本語 (японски)',
];