<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Titles Language Lines
    |--------------------------------------------------------------------------
    |
    */

    'start' => 'Нов профил',
    'capture' => 'Заснеми QR',
    'accounts' => 'Профили',
    'createAccount' => 'Създай профил',
    'importAccounts' => 'Импортиране на профили',
    'editAccount' => 'Промени профил',
    'showQRcode' => 'Профил като QR код',
    'groups' => 'Групи',
    'createGroup' => 'Създай група',
    'editGroup' => 'Промяна на група',
    'settings' => [
        'options' => 'Настроики',
        'account' => 'Потребителски профил',
        'oauth' => [
            'tokens' => 'OAuth токени',
            'generatePAT' => 'Нов персонален токен',
        ],
        'webauthn' => [
            'editCredential' => 'Редакция на устройство',
            'devices' => 'WebAuthn устройства',
        ],
    ],
    'login' => 'Вход',
    'register' => 'Регистрация',
    'autolock' => 'Авт. заключване',
    'password' => [
        'request' => 'Нулиране на паролата',
        'reset' => 'Нова парола',
    ],
    'webauthn' => [
        'lost' => 'Възстановяване на профил',
        'recover' => 'Регистриране на устройство',
    ],
    'flooded' => 'Наводнение',
    'genericError' => 'Грешка',
    '404' => 'Записът не е намерен',
    'about' => 'Относно',
];