<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Language names
    |--------------------------------------------------------------------------
    |
    |
    */

    'browser_preference' => 'ブラウザの設定',
    'en' => 'English (英語)',
    'fr' => 'Français (フランス語)',
    'de' => 'Deutsch (ドイツ語)',
    'es' => 'Español (スペイン語)',
    'zh' => '简体中文 (簡体字中国語)',
    'ru' => 'Русский (ロシア語)',
    'bg' => 'Български (ブルガリア語)',
    'ja' => '日本語 (日本語)',
    'hi' => 'हिंदी (ヒンディー語)',
];