<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Language names
    |--------------------------------------------------------------------------
    |
    |
    */

    'browser_preference' => '跟随浏览器语言',
    'en' => 'English (英语)',
    'fr' => 'Français (法语)',
    'de' => 'Deutsch (德语)',
    'es' => 'Español (西班牙语)',
    'zh' => '中文 (简体中文)',
    'ru' => 'Русский (俄语)',
    'bg' => 'Български (保加利亚语)',
    'ja' => '日本語 (日语)',
    'hi' => 'हिंदी (印地语)',
    'tr' => 'Türkçe (土耳其语)',
];