<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Language names
    |--------------------------------------------------------------------------
    |
    |
    */

    'browser_preference' => '跟随浏览器语言',
    'en' => 'English (英语)',
    'fr' => 'Français (法语)',
    'bg' => 'Български (保加利亚语)',
    'zh-CN' => '中文 (简体中文)',
    'da' => 'Dansk (丹麦语)',
    'nl' => 'Nederlands (荷兰语)',
    'de' => 'Deutsch (德语)',
    'hi' => 'हिंदी (印地语)',
    'it' => 'Italiano (意大利语)',
    'ja' => '日本語 (日语)',
    'ko' => '한국어 (韩语)',
    'pt-BR' => 'Português (葡萄牙语，巴西语)',
    'ru' => 'Русский (俄语)',
    'es-ES' => 'Español (西班牙语)',
    'tr' => 'Türkçe (土耳其语)',
];