<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Language names
    |--------------------------------------------------------------------------
    |
    |
    */

    'browser_preference' => 'ब्राउज़र की प्राथमिकता',
    'en' => 'English (इंग्लिश)',
    'fr' => 'Français (फ्रेंच)',
    'de' => 'Deutsch (जर्मन)',
    'es' => 'Español (स्पैनिश)',
    'zh' => '简体中文 (सामान्य चीनी)',
    'ru' => 'Русский (रशिअन)',
    'bg' => 'Български (बुल्गेरियन)',
    'ja' => '日本語 (जापानी)',
    'hi' => 'हिंदी (हिंदी)',
    'tr' => 'Türkçe (Turkish)',
];