<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Language names
    |--------------------------------------------------------------------------
    |
    |
    */

    'browser_preference' => 'Настройки браузера',
    'en' => 'English (Английский)',
    'fr' => 'Français (Французский)',
    'bg' => 'Български (Болгарский)',
    'zh-CN' => '简体中文 (Китайский упрощенный)',
    'da' => 'Dansk (Датский)',
    'nl' => 'Nederlands (Голландский)',
    'de' => 'Deutsch (Немецкий)',
    'hi' => 'हिंदी (Хинди)',
    'it' => 'Italiano (Итальянский)',
    'ja' => '日本語 (Японский)',
    'ko' => '한국어 (Корейский)',
    'pt-BR' => 'Português (Португальский, Бразильский)',
    'ru' => 'Русский (Русский)',
    'es-ES' => 'Español (Испанский)',
    'tr' => 'Türkçe (Турецкий)',
];