<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Language names
    |--------------------------------------------------------------------------
    |
    |
    */

    'browser_preference' => 'Настройки браузера',
    'en' => 'English (Английский)',
    'fr' => 'Français (Французский)',
    'de' => 'Deutsch (Немецкий)',
    'es' => 'Español (Испанский)',
    'zh' => '简体中文 (Китайский упрощенный)',
    'ru' => 'Русский (Русский)',
    'bg' => 'Български (Болгарский)',
    'ja' => '日本語 (Японский)',
    'hi' => 'हिंदी (Hindi)',
];