<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Titles Language Lines
    |--------------------------------------------------------------------------
    |
    */

    'start' => 'Новая учётная запись',
    'capture' => 'Отсканируйте QR',
    'accounts' => 'Учётные записи',
    'createAccount' => 'Создать учётную запись',
    'importAccounts' => 'Импорт учётных записей',
    'editAccount' => 'Редактирование учётной записи',
    'showQRcode' => 'Учётная запись как QR-код',
    'groups' => 'Группы',
    'createGroup' => 'Создать группу',
    'editGroup' => 'Изменение группы',
    'settings' => [
        'options' => 'Настройки',
        'account' => 'Учётные записи пользователя',
        'oauth' => [
            'tokens' => 'OAuth Токены',
            'generatePAT' => 'Новый персональный токен',
        ],
        'webauthn' => [
            'editCredential' => 'Редактирование устройства',
            'devices' => 'Устройства WebAuthn',
        ],
    ],
    'login' => 'Вход',
    'register' => 'Регистрация',
    'autolock' => 'Автоблокировка',
    'password' => [
        'request' => 'Восстановить пароль',
        'reset' => 'Новый пароль',
    ],
    'webauthn' => [
        'lost' => 'Восстановление доступа к учётной записи',
        'recover' => 'Зарегистрировать новое устройство',
    ],
    'flooded' => 'Слишком много запросов',
    'genericError' => 'Ошибка',
    '404' => 'Элемент не найден',
    'about' => 'О программе',
    'admin' =>  [
        'appSetup' => 'Настройки приложения',
        'users' => 'Управление пользователями',
        'createUser' => 'Создать пользователя',
        'manageUser' => 'Управление пользователем',
    ]
];